#include <iostream>
#include <fstream>
#include <iostream>
#include <vector>
#include <iomanip>
#include <iterator>
#include <algorithm>
#include <map>
#include <set>
#include <sstream>

using namespace std;



int SIZE = 10;





// Вказівники
// Реалізувати функцію, яка приймає два числа від користувача, та створює динамічну змінну, яка містить їх суму. 


// Динамічне створення масиву: Напишіть програму, яка дозволяє користувачеві вводити розмір масиву, 
// а потім динамічно виділяє пам'ять для масиву цього розміру.


// Написати функцію яка приймає вказівник на динамічний масив і його розмір. 
// Функція повинна видалити з масиву всі від'ємні значення, та повернути вказівник на новий динамічний масив.
